Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC00/include/component/fuses.h
/* -------- FUSES_FUCFG1 : (FUSES Offset: 0x44) (R/W 32) User Configuration 1 (System Bus Configuration) -------- */
#define FUSES_FUCFG1_Msk                      _UINT32_(0x00000000)                                 /* (FUSES_FUCFG1) Register Mask  */


/* -------- FUSES_FUCFG10 : (FUSES Offset: 0x68) (R/W 32) IDAU_NONSECA -------- */
#define FUSES_FUCFG10_BOOTROM_NONSECA_Pos     _UINT32_(0)                                          /* (FUSES_FUCFG10) BOOTROM NONSECA Position */
#define FUSES_FUCFG10_BOOTROM_NONSECA_Msk     (_UINT32_(0xFFFFFFFF) << FUSES_FUCFG10_BOOTROM_NONSECA_Pos) /* (FUSES_FUCFG10) BOOTROM NONSECA Mask */
#define FUSES_FUCFG10_BOOTROM_NONSECA(value)  (FUSES_FUCFG10_BOOTROM_NONSECA_Msk & (_UINT32_(value) << FUSES_FUCFG10_BOOTROM_NONSECA_Pos)) /* Assigment of value for BOOTROM_NONSECA in the FUSES_FUCFG10 register */
#define FUSES_FUCFG10_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (FUSES_FUCFG10) Register Mask  */


/* -------- FUSES_FUCFG11 : (FUSES Offset: 0x6C) (R/W 32) IDAU_NONSECB -------- */
#define FUSES_FUCFG11_BOOTROM_NONSECB_Pos     _UINT32_(0)                                          /* (FUSES_FUCFG11) BOOTROM NONSECB Position */
#define FUSES_FUCFG11_BOOTROM_NONSECB_Msk     (_UINT32_(0xFFFFFFFF) << FUSES_FUCFG11_BOOTROM_NONSECB_Pos) /* (FUSES_FUCFG11) BOOTROM NONSECB Mask */
#define FUSES_FUCFG11_BOOTROM_NONSECB(value)  (FUSES_FUCFG11_BOOTROM_NONSECB_Msk & (_UINT32_(value) << FUSES_FUCFG11_BOOTROM_NONSECB_Pos)) /* Assigment of value for BOOTROM_NONSECB in the FUSES_FUCFG11 register */
#define FUSES_FUCFG11_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (FUSES_FUCFG11) Register Mask  */


/* -------- FUSES_FUCFG12 : (FUSES Offset: 0x70) (R/W 32) IDAU_NONSECC -------- */
#define FUSES_FUCFG12_BOOTROM_NONSECC_Pos     _UINT32_(0)                                          /* (FUSES_FUCFG12) BOOTROM NONSECC Position */
#define FUSES_FUCFG12_BOOTROM_NONSECC_Msk     (_UINT32_(0xFFFFFFFF) << FUSES_FUCFG12_BOOTROM_NONSECC_Pos) /* (FUSES_FUCFG12) BOOTROM NONSECC Mask */
#define FUSES_FUCFG12_BOOTROM_NONSECC(value)  (FUSES_FUCFG12_BOOTROM_NONSECC_Msk & (_UINT32_(value) << FUSES_FUCFG12_BOOTROM_NONSECC_Pos)) /* Assigment of value for BOOTROM_NONSECC in the FUSES_FUCFG12 register */
#define FUSES_FUCFG12_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (FUSES_FUCFG12) Register Mask  */


/* -------- FUSES_FUCFG13 : (FUSES Offset: 0x74) (R/W 32) IDAU_NONSECAHB -------- */
#define FUSES_FUCFG13_BOOTROM_NONSECAHB_Pos   _UINT32_(0)                                          /* (FUSES_FUCFG13) BOOTROM NONSECAHB Position */
#define FUSES_FUCFG13_BOOTROM_NONSECAHB_Msk   (_UINT32_(0xFFFFFFFF) << FUSES_FUCFG13_BOOTROM_NONSECAHB_Pos) /* (FUSES_FUCFG13) BOOTROM NONSECAHB Mask */
#define FUSES_FUCFG13_BOOTROM_NONSECAHB(value) (FUSES_FUCFG13_BOOTROM_NONSECAHB_Msk & (_UINT32_(value) << FUSES_FUCFG13_BOOTROM_NONSECAHB_Pos)) /* Assigment of value for BOOTROM_NONSECAHB in the FUSES_FUCFG13 register */
#define FUSES_FUCFG13_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (FUSES_FUCFG13) Register Mask  */


/* -------- FUSES_FUCFG14 : (FUSES Offset: 0x78) (R/W 32) PFM IDAU Configuration -------- */
#define FUSES_FUCFG14_ANS_Pos                 _UINT32_(0)                                          /* (FUSES_FUCFG14) Non-secure Flash application size Position */
#define FUSES_FUCFG14_ANS_Msk                 (_UINT32_(0x1FF) << FUSES_FUCFG14_ANS_Pos)           /* (FUSES_FUCFG14) Non-secure Flash application size Mask */
#define FUSES_FUCFG14_ANS(value)              (FUSES_FUCFG14_ANS_Msk & (_UINT32_(value) << FUSES_FUCFG14_ANS_Pos)) /* Assigment of value for ANS in the FUSES_FUCFG14 register */
#define FUSES_FUCFG14_ANSC_Pos                _UINT32_(16)                                         /* (FUSES_FUCFG14) Non-secure callable Flash application size Position */
#define FUSES_FUCFG14_ANSC_Msk                (_UINT32_(0x1) << FUSES_FUCFG14_ANSC_Pos)            /* (FUSES_FUCFG14) Non-secure callable Flash application size Mask */
#define FUSES_FUCFG14_ANSC(value)             (FUSES_FUCFG14_ANSC_Msk & (_UINT32_(value) << FUSES_FUCFG14_ANSC_Pos)) /* Assigment of value for ANSC in the FUSES_FUCFG14 register */
#define FUSES_FUCFG14_Msk                     _UINT32_(0x000101FF)                                 /* (FUSES_FUCFG14) Register Mask  */


/* -------- FUSES_FUCFG15 : (FUSES Offset: 0x7C) (R/W 32) RAM IDAU Configuration -------- */
#define FUSES_FUCFG15_RNS_Pos                 _UINT32_(0)                                          /* (FUSES_FUCFG15) Non-secure RAM size Position */
#define FUSES_FUCFG15_RNS_Msk                 (_UINT32_(0x7F) << FUSES_FUCFG15_RNS_Pos)            /* (FUSES_FUCFG15) Non-secure RAM size Mask */
#define FUSES_FUCFG15_RNS(value)              (FUSES_FUCFG15_RNS_Msk & (_UINT32_(value) << FUSES_FUCFG15_RNS_Pos)) /* Assigment of value for RNS in the FUSES_FUCFG15 register */
#define FUSES_FUCFG15_Msk                     _UINT32_(0x0000007F)                                 /* (FUSES_FUCFG15) Register Mask  */


/* -------- FUSES_FUCFG16 : (FUSES Offset: 0x80) (R/W 32) User Configuration 16 (HSM Firmware Metadata 0 Address) -------- */
#define FUSES_FUCFG16_HSM_PTRMETA0_Pos        _UINT32_(0)                                          /* (FUSES_FUCFG16) HSM Firmware Metadata pointer 0 Position */
#define FUSES_FUCFG16_HSM_PTRMETA0_Msk        (_UINT32_(0xFFFFFFFF) << FUSES_FUCFG16_HSM_PTRMETA0_Pos) /* (FUSES_FUCFG16) HSM Firmware Metadata pointer 0 Mask */
#define FUSES_FUCFG16_HSM_PTRMETA0(value)     (FUSES_FUCFG16_HSM_PTRMETA0_Msk & (_UINT32_(value) << FUSES_FUCFG16_HSM_PTRMETA0_Pos)) /* Assigment of value for HSM_PTRMETA0 in the FUSES_FUCFG16 register */
#define FUSES_FUCFG16_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (FUSES_FUCFG16) Register Mask  */


/* -------- FUSES_FUCFG2 : (FUSES Offset: 0x48) (R/W 32) User Configuration 2 (Deep Sleep SMOR Configuration) -------- */
#define FUSES_FUCFG2_BRCFGUDSSMOR_BOR_HYST_Pos _UINT32_(0)                                          /* (FUSES_FUCFG2) BOT Trip Hystersis Position */
#define FUSES_FUCFG2_BRCFGUDSSMOR_BOR_HYST_Msk (_UINT32_(0x1) << FUSES_FUCFG2_BRCFGUDSSMOR_BOR_HYST_Pos) /* (FUSES_FUCFG2) BOT Trip Hystersis Mask */
#define FUSES_FUCFG2_BRCFGUDSSMOR_BOR_HYST(value) (FUSES_FUCFG2_BRCFGUDSSMOR_BOR_HYST_Msk & (_UINT32_(value) << FUSES_FUCFG2_BRCFGUDSSMOR_BOR_HYST_Pos)) /* Assigment of value for BRCFGUDSSMOR_BOR_HYST in the FUSES_FUCFG2 register */
#define FUSES_FUCFG2_BRCFGUDSSMOR_BOR_TRIP_Pos _UINT32_(1)                                          /* (FUSES_FUCFG2) BOT Trip Points Position */
#define FUSES_FUCFG2_BRCFGUDSSMOR_BOR_TRIP_Msk (_UINT32_(0x3) << FUSES_FUCFG2_BRCFGUDSSMOR_BOR_TRIP_Pos) /* (FUSES_FUCFG2) BOT Trip Points Mask */
#define FUSES_FUCFG2_BRCFGUDSSMOR_BOR_TRIP(value) (FUSES_FUCFG2_BRCFGUDSSMOR_BOR_TRIP_Msk & (_UINT32_(value) << FUSES_FUCFG2_BRCFGUDSSMOR_BOR_TRIP_Pos)) /* Assigment of value for BRCFGUDSSMOR_BOR_TRIP in the FUSES_FUCFG2 register */
#define FUSES_FUCFG2_Msk                      _UINT32_(0x00000007)                                 /* (FUSES_FUCFG2) Register Mask  */


/* -------- FUSES_FUCFG24 : (FUSES Offset: 0xA0) (R/W 32) User Configuration 24 (HSM Firmware Metadata 1 Address) -------- */
#define FUSES_FUCFG24_HSM_PTRMETA1_Pos        _UINT32_(0)                                          /* (FUSES_FUCFG24) HSM Firmware Metadata pointer 1 Position */
#define FUSES_FUCFG24_HSM_PTRMETA1_Msk        (_UINT32_(0xFFFFFFFF) << FUSES_FUCFG24_HSM_PTRMETA1_Pos) /* (FUSES_FUCFG24) HSM Firmware Metadata pointer 1 Mask */
#define FUSES_FUCFG24_HSM_PTRMETA1(value)     (FUSES_FUCFG24_HSM_PTRMETA1_Msk & (_UINT32_(value) << FUSES_FUCFG24_HSM_PTRMETA1_Pos)) /* Assigment of value for HSM_PTRMETA1 in the FUSES_FUCFG24 register */
#define FUSES_FUCFG24_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (FUSES_FUCFG24) Register Mask  */


/* -------- FUSES_FUCFG3 : (FUSES Offset: 0x4C) (R/W 32) User Configuration 2 (SMOR Configuration) -------- */
#define FUSES_FUCFG3_HYST_BOR_VDDIO_Pos       _UINT32_(0)                                          /* (FUSES_FUCFG3) BOR Trip Point Hystersis for VDDIO Position */
#define FUSES_FUCFG3_HYST_BOR_VDDIO_Msk       (_UINT32_(0x1) << FUSES_FUCFG3_HYST_BOR_VDDIO_Pos)   /* (FUSES_FUCFG3) BOR Trip Point Hystersis for VDDIO Mask */
#define FUSES_FUCFG3_HYST_BOR_VDDIO(value)    (FUSES_FUCFG3_HYST_BOR_VDDIO_Msk & (_UINT32_(value) << FUSES_FUCFG3_HYST_BOR_VDDIO_Pos)) /* Assigment of value for HYST_BOR_VDDIO in the FUSES_FUCFG3 register */
#define FUSES_FUCFG3_BOR_TRIP_VDDIO_Pos       _UINT32_(1)                                          /* (FUSES_FUCFG3) BOR Trip Points for VDDIO Position */
#define FUSES_FUCFG3_BOR_TRIP_VDDIO_Msk       (_UINT32_(0x3) << FUSES_FUCFG3_BOR_TRIP_VDDIO_Pos)   /* (FUSES_FUCFG3) BOR Trip Points for VDDIO Mask */
#define FUSES_FUCFG3_BOR_TRIP_VDDIO(value)    (FUSES_FUCFG3_BOR_TRIP_VDDIO_Msk & (_UINT32_(value) << FUSES_FUCFG3_BOR_TRIP_VDDIO_Pos)) /* Assigment of value for BOR_TRIP_VDDIO in the FUSES_FUCFG3 register */
#define FUSES_FUCFG3_HYST_BOR_VDDIOB_Pos      _UINT32_(3)                                          /* (FUSES_FUCFG3) BOR Trip Point Hystersis for VDDIOB Position */
#define FUSES_FUCFG3_HYST_BOR_VDDIOB_Msk      (_UINT32_(0x1) << FUSES_FUCFG3_HYST_BOR_VDDIOB_Pos)  /* (FUSES_FUCFG3) BOR Trip Point Hystersis for VDDIOB Mask */
#define FUSES_FUCFG3_HYST_BOR_VDDIOB(value)   (FUSES_FUCFG3_HYST_BOR_VDDIOB_Msk & (_UINT32_(value) << FUSES_FUCFG3_HYST_BOR_VDDIOB_Pos)) /* Assigment of value for HYST_BOR_VDDIOB in the FUSES_FUCFG3 register */
#define FUSES_FUCFG3_BOR_TRIP_VDDIOB_Pos      _UINT32_(4)                                          /* (FUSES_FUCFG3) BOR Trip Points for VDDIOB Position */
#define FUSES_FUCFG3_BOR_TRIP_VDDIOB_Msk      (_UINT32_(0x3) << FUSES_FUCFG3_BOR_TRIP_VDDIOB_Pos)  /* (FUSES_FUCFG3) BOR Trip Points for VDDIOB Mask */
#define FUSES_FUCFG3_BOR_TRIP_VDDIOB(value)   (FUSES_FUCFG3_BOR_TRIP_VDDIOB_Msk & (_UINT32_(value) << FUSES_FUCFG3_BOR_TRIP_VDDIOB_Pos)) /* Assigment of value for BOR_TRIP_VDDIOB in the FUSES_FUCFG3 register */
#define FUSES_FUCFG3_HYST_BOR_VDDA_Pos        _UINT32_(6)                                          /* (FUSES_FUCFG3) BOR Trip Point Hystersis for VDDANA Position */
#define FUSES_FUCFG3_HYST_BOR_VDDA_Msk        (_UINT32_(0x1) << FUSES_FUCFG3_HYST_BOR_VDDA_Pos)    /* (FUSES_FUCFG3) BOR Trip Point Hystersis for VDDANA Mask */
#define FUSES_FUCFG3_HYST_BOR_VDDA(value)     (FUSES_FUCFG3_HYST_BOR_VDDA_Msk & (_UINT32_(value) << FUSES_FUCFG3_HYST_BOR_VDDA_Pos)) /* Assigment of value for HYST_BOR_VDDA in the FUSES_FUCFG3 register */
#define FUSES_FUCFG3_BOR_TRIP_VDDA_Pos        _UINT32_(7)                                          /* (FUSES_FUCFG3) BOR Trip Points for VDDANA Position */
#define FUSES_FUCFG3_BOR_TRIP_VDDA_Msk        (_UINT32_(0x3) << FUSES_FUCFG3_BOR_TRIP_VDDA_Pos)    /* (FUSES_FUCFG3) BOR Trip Points for VDDANA Mask */
#define FUSES_FUCFG3_BOR_TRIP_VDDA(value)     (FUSES_FUCFG3_BOR_TRIP_VDDA_Msk & (_UINT32_(value) << FUSES_FUCFG3_BOR_TRIP_VDDA_Pos)) /* Assigment of value for BOR_TRIP_VDDA in the FUSES_FUCFG3 register */
#define FUSES_FUCFG3_HYST_BOR_VDDREG_Pos      _UINT32_(10)                                         /* (FUSES_FUCFG3) BOR Trip Point Hystersis for VDDREG Position */
#define FUSES_FUCFG3_HYST_BOR_VDDREG_Msk      (_UINT32_(0x1) << FUSES_FUCFG3_HYST_BOR_VDDREG_Pos)  /* (FUSES_FUCFG3) BOR Trip Point Hystersis for VDDREG Mask */
#define FUSES_FUCFG3_HYST_BOR_VDDREG(value)   (FUSES_FUCFG3_HYST_BOR_VDDREG_Msk & (_UINT32_(value) << FUSES_FUCFG3_HYST_BOR_VDDREG_Pos)) /* Assigment of value for HYST_BOR_VDDREG in the FUSES_FUCFG3 register */
#define FUSES_FUCFG3_Msk                      _UINT32_(0x000005FF)                                 /* (FUSES_FUCFG3) Register Mask  */


